key=0
while key == 0:
    try:
        money_in=int(input("Введите сумму в рублях: "))
        key = 1
    except ValueError:
        print("Неверный формат данных. Попробуйте снова. ")
        pass
    if money_in>9999:
        print("Слишком большое число. Введите поменьше. ")
        key=0
    if money_in<0:
        print("Число должно быть положительным.")
        key=0
money_out=""
thous=money_in // 1000
hundr=money_in % 1000 // 100
tens=money_in % 100 // 10
ones=money_in % 10
tyscy=["", "одна тысяча ", "две тысячи ", "три тысячи ", "четыре тысячи ", "пять тысяч ", "шесть тысяч ", "семь тысяч ", "восемь тысяч ", "девять тысяч "]
sotny=['', "сто ", "двести ", "триста ", "четыреста ", "пятьсот ", "шестьсот ", "семьсот ", "восемьсот ", "девятьсот "]
desyatky=["", "", "двадцать ", "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семьдесят ", "восемьдесят ", "девяносто "]
desyatky_if=["десять ", "одиннадцать ", "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать ", "восемнадцать ", "девятнадцать "]
edinitsy=["", "один ", "два ", "три ", "четыре ", "пять ", "шесть ", "семь ", "восемь ", "девять "]
rubli=["рублей", "рубль", "рубля", "рубля", "рубля", "рублей", "рублей", "рублей", "рублей", "рублей"]
money_out+=tyscy[thous]
money_out+=sotny[hundr]
if tens==1:
    money_out+=desyatky_if[ones]+rubli[0]
else:
    money_out+=desyatky[tens]+edinitsy[ones]+rubli[ones]
if money_in==0:
    money_out+="ноль " +rubli[0]
print(money_out.capitalize())
